&НаКлиенте
Процедура ТоварыПриИзменении(Элемент, ИзмененнаяКолонка)
	Если ИзмененнаяКолонка = "Цена" или "Количество" Тогда
		Строка = Элемент.ТекущиеДанные;
		Строка.Сумма = Строка.Цена * Строка.Количество;
	КонецЕсли;
	Если ИзмененнаяКолонка = "Сумма" Тогда
		Строка = Элемент.ТекущиеДанные;
		Если Строка.Количество = 0 Тогда
			Строка.Количество = 1;
		КонецЕсли;
		Строка.Цена = Строка.Сумма / Строка.Количество;
	КонецЕсли;
	ПроверитьБюджет();
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьБюджет()
	ОбщаяСумма = 0;
	Для Каждого СТрока Из Товары Цикл
		ОбщаяСумма = ОбщаяСумма + Строка.Сумма;
	КонецЦикла;
	
	Если ОбщаяСумма > ОбщийБюджет Тогда
		ЭлементыФормы.НадписьПревышение.Видимость = Истина;
		ЭлементыФормы.НадписьПревышение.Заголовок = "Превышение бюджета!";
	Иначе
		ЭлементФормы.НадписьПревышение.Видимость = Ложь;
	КонецЕсли;
КонецПРоцедуры


&НаКлиенте
Процедура ОбщийБюджетПриИзменении(Элемент)
	ПроверитьБюджет();
КонецПроцедуры

	
		
			