
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Строка = Элемент.Товары.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Строка.Цена = Строка.Номенклатура.ЦенаПоУмолчанию;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	//Элементы.Товары.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Строка = Элемент.Товары.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	//Элементы.Товары.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Строка = Элемент.Товары.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	//Элементы.Товары.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	Строка = Элемент.Товары.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Строка.Количество = 0 Тогда
		Строка.Количество = 1;
	КонецЕсли;
	Строка.Цена = Строка.Сумма / Строка.Количество;
	//Элементы.Товары.Обновить();
КонецПроцедуры


