&НаСервереБезКонтекста 
Функция ТоварыНоменклатураЦенаПоУмолчаниюНаСервере(СсылкаНоменклатура) 
 Возврат СсылкаНоменклатура.ЦенаПоУмолчанию; 
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Строка.Цена) Тогда
		Возврат;
	КонецЕсли;
  	Строка.Цена = ТоварыНоменклатураЦенаПоУмолчаниюНаСервере(Строка.Номенклатура);
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Элементы.Товары.Обновить();         ;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Элементы.Товары.Обновить();           
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Элементы.Товары.Обновить();          
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Строка.Количество = 0 Тогда
		Строка.Количество = 1;
	КонецЕсли;
	Строка.Цена = Строка.Сумма / Строка.Количество;
	Элементы.Товары.Обновить();        
КонецПроцедуры

                                

