
&НаСервере
Функция ПечатьНакладнойТабДок()
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = Документы.РеализацияТоваровУслуг.ПолучитьМакет("ТоварнаяНакладная");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ОбластьШапка.Параметры.Номер = Объект.Номер;    
	ОбластьШапка.Параметры.Дата = Объект.Дата;
	ОбластьШапка.Параметры.Покупатель = Объект.Клиент; 
	ОбластьШапка.Параметры.Договор = Объект.Договор;
	ОбластьШапка.Параметры.Склад = Объект.Склад;        
	ОбластьШапка.Параметры.Телефон = Объект.Клиент.Телефон;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Возврат ТабличныйДокумент;
КонецФункции

&НаКлиенте
Процедура ПечатьНакладной(Команда)
	ТабДок = ПечатьНакладнойТабДок();
	ТабДок.Показать();
КонецПроцедуры
